src/cf/Documents/СписаниеЗаПокупки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СписаниеЗаПокупки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Бонусы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Покупка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бонусы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/HTTPServices/Бонусы/Ext/Module.bsl
Функция ПроверкаСвязиGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200, "The bonus debit service is available");
	Возврат Ответ;
КонецФункции

Функция СписатьЗаПокупкуPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(500);
	КонтрагентПредставление = "Не найден";
	КонтрагентСтрокой = "";
	ДокументПредставление = "Не найден";
	Бонусы = 0; 
	
	Версия = Запрос.ПараметрыURL.Получить("Версия");
	Если ТипЗнч(Версия) = Тип("Строка") И Версия = "v1" Тогда
		
		ТелоЗапросаJSON = Запрос.ПолучитьТелоКакСтроку();
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоЗапросаJSON);
		
		ДанныеПокупки = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		КонтрагентГУИД = "";
		ОснованиеГУИД = "";
		Бонусы = 0;
		
		Если ДанныеПокупки.Свойство("counterparty_id", КонтрагентГУИД) И ДанныеПокупки.Свойство("document_id", ОснованиеГУИД) И ДанныеПокупки.Свойство("bonus", Бонусы) Тогда
			
			Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(КонтрагентГУИД));
			КонтрагентПредставление = XMLСтрока(Контрагент);
			КонтрагентСтрокой = XMLСтрока(Контрагент.УникальныйИдентификатор());
			
			Основание = Документы.Покупка.ПолучитьСсылку(Новый УникальныйИдентификатор(ОснованиеГУИД));
			
			ДокументОбъект = Документы.СписаниеЗаПокупки.СоздатьДокумент();
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			ДокументОбъект.Контрагент = Контрагент;
			ДокументОбъект.Основание = Основание;
			ДокументОбъект.Бонусы = Бонусы;
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Ответ.КодСостояния = 200; 
				ДокументПредставление = XMLСтрока(ДокументОбъект.Ссылка);
				ДокументСтрокой = XMLСтрока(ДокументОбъект.Ссылка.УникальныйИдентификатор());
				ШаблонОтвета = "Для контрагента <%1> (ГУИД %2) выполнено списание %3 бонусов документом <%4> (ГУИД %5)";
				ТекстОтвета = СтрШаблон(ШаблонОтвета, КонтрагентПредставление, КонтрагентСтрокой, Бонусы, ДокументПредставление, ДокументСтрокой);
			Исключение
				ТекстОтвета = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураДляОтвета = Новый Структура();
	СтруктураДляОтвета.Вставить("counterparty", КонтрагентПредставление);
	СтруктураДляОтвета.Вставить("counterparty_id", КонтрагентСтрокой);
	СтруктураДляОтвета.Вставить("document", ДокументПредставление);
	СтруктураДляОтвета.Вставить("document_id", ДокументСтрокой);
	СтруктураДляОтвета.Вставить("bonus", Бонусы);
	СтруктураДляОтвета.Вставить("description", ТекстОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДляОтвета);
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции
